# 데이터프레임 복습

# 1.환경준비

## (1) 라이브러리 불러오기

In [40]:
import numpy as np
import pandas as pd

## (2) 데이터 로딩

### 1) titanic
* url :  'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'

**[titanic_simple 데이터 셋 정보]**

- PassengerId : 승객번호
- Survived : 생존여부(1:생존, 0:사망)
- Pclass : 객실등급(1:1등급, 2:2등급, 3:3등급)
- Name : 승객이름
- Sex : 성별(male, female)
- Age : 나이
- Fare : 운임($)
- Embarked : 승선지역(Southampton, Cherbourg, Queenstown)

In [41]:
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'
titanic = pd.read_csv(path)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton

### 2) New York Air Quality

* url : https://raw.githubusercontent.com/DA4BAM/dataset/master/air2.csv

**[airquality 데이터 셋 정보]**

- Ozone: 오존 농도  
- Solar.R: 태양복사량
- Wind: 풍속
- Temp: 기온
- Date : 연,월,일

In [42]:
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/air2.csv'
air = pd.read_csv(path)
air.head()

   Ozone  Solar.R  Wind  Temp        Date
0     41    190.0   7.4    67  1973-05-01
1     36    118.0   8.0    72  1973-05-02
2     12    149.0  12.6    74  1973-05-03
3     18    313.0  11.5    62  1973-05-04
4     19      NaN  14.3    56  1973-05-05

# 2.데이터프레임 정보 조회하기

* 두 데이터프레임에 대해서 다음의 정보를 조회해 봅시다.

### (1) 상위 5개 행 조회

In [43]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton

In [44]:
air.head()

   Ozone  Solar.R  Wind  Temp        Date
0     41    190.0   7.4    67  1973-05-01
1     36    118.0   8.0    72  1973-05-02
2     12    149.0  12.6    74  1973-05-03
3     18    313.0  11.5    62  1973-05-04
4     19      NaN  14.3    56  1973-05-05

### (2) 행과 열의 수

In [45]:
print(titanic.shape)
print(air.shape)

(891, 8)
(153, 5)

### (3) 칼럼 정보

In [46]:
print(titanic.info())
print(air.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Ozone    153 non-null    int64
 1   Solar.R  146 non-null    float64
 2   Wind     153 non-null    float64
 3   Temp     153 non-null    int64
 4   Date     153 non-null    object
dtypes: float64(2), int64(2), object(1)
memory usage: 6.1+ KB
None

### (4) 칼럼 이름만 리스트에 담아 조회

In [47]:
print(titanic.columns)
print(air.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare',
       'Embarked'],
      dtype='object')
Index(['Ozone', 'Solar.R', 'Wind', 'Temp', 'Date'], dtype='object')

### (5) 데이터프레임 각 열 들의 기초통계량 조회

In [48]:
print(titanic.describe())
print(air.describe())

       PassengerId    Survived      Pclass         Age        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118   32.204208
std     257.353842    0.486592    0.836071   14.526497   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    7.910400
50%     446.000000    0.000000    3.000000   28.000000   14.454200
75%     668.500000    1.000000    3.000000   38.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000  512.329200
            Ozone     Solar.R        Wind        Temp
count  153.000000  146.000000  153.000000  153.000000
mean    42.052288  185.931507    9.957516   77.882353
std     30.156127   90.058422    3.523001    9.465270
min      1.000000    7.000000    1.700000   56.000000
25%     20.000000  115.750000    7.400000   72.000000
50%     34.000000  205.000000    9.700000   79.000000
75%     59.000000  258.750000   11.500000   85.000000
max    168.000000  334.000000   20.700000   97.000000

### (6) 데이터프레임에 NaN이 존재하는지 확인

In [49]:
print(titanic.isna().sum())
print(air.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
Fare             0
Embarked         2
dtype: int64
Ozone      0
Solar.R    7
Wind       0
Temp       0
Date       0
dtype: int64

# 3.데이터프레임 조건 조회(.loc)

* 다음 질문에 맞는 조회를 수행하시오.

### (1) [titanic] 객실 등급(Pclass) 1등급, 나이(Age) 10살 이하 탑승객 조회

In [50]:
titanic[(titanic['Pclass']==1) & (titanic['Age']<=10)]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,151.5500,Southampton
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,151.5500,Southampton
445,446,1,1,"Dodge, Master. Washington",male,4.00,81.8583,Southampton

### (2) [titanic] 객실 등급(Pclass)별 탑승객 수

In [51]:
titanic.groupby(by='Pclass', as_index=False)['PassengerId'].count()

   Pclass  PassengerId
0       1          216
1       2          184
2       3          491

### (3) [titanic] 성별(Sex)이 남자인 탑승객과 여자인 탑승객의 나이를 각각 저장하시오.

In [54]:
titanic[titanic['Sex']=='female']['Age'].unique()

array([38.  , 26.  , 35.  , 27.  , 14.  ,  4.  , 58.  , 55.  , 31.  ,
         nan, 15.  ,  8.  , 18.  , 40.  ,  3.  , 19.  , 49.  , 29.  ,
       21.  ,  5.  , 17.  , 16.  , 30.  , 33.  , 23.  , 34.  , 28.  ,
       14.5 , 20.  ,  2.  , 32.5 , 47.  , 22.  , 24.  ,  9.  , 45.  ,
        1.  , 50.  , 32.  , 44.  , 25.  , 41.  , 63.  , 36.  , 60.  ,
       42.  , 10.  , 13.  ,  0.75, 54.  , 37.  ,  7.  , 11.  , 48.  ,
       39.  , 53.  , 52.  , 43.  ,  6.  , 51.  , 30.5 , 57.  , 62.  ,
       56.  ])

In [53]:
titanic[titanic['Sex']=='male']['Age'].unique()

array([22.  , 35.  ,   nan, 54.  ,  2.  , 20.  , 39.  , 34.  , 28.  ,
       19.  , 40.  , 66.  , 42.  , 21.  ,  7.  , 65.  , 28.5 , 11.  ,
       45.  ,  4.  , 26.  , 32.  , 25.  ,  0.83, 29.  , 16.  , 24.  ,
       46.  , 59.  , 71.  , 23.  , 33.  , 37.  , 38.  , 47.  , 70.5 ,
       32.5 , 12.  , 18.  , 27.  , 36.5 , 51.  , 55.5 , 40.5 , 30.  ,
       44.  , 17.  ,  1.  ,  9.  , 61.  , 56.  , 36.  ,  3.  , 45.5 ,
       20.5 , 62.  , 52.  , 23.5 ,  0.92, 43.  , 15.  , 50.  , 64.  ,
       31.  , 49.  , 48.  , 58.  , 55.  ,  8.  , 60.  , 57.  , 80.  ,
       70.  , 24.5 , 14.  ,  6.  ,  0.67, 41.  ,  0.42, 30.5 , 10.  ,
       34.5 , 74.  ])

### (4) [titanic] 나이(Age)에 NaN이 아닌 탑승객을 조회하시오.

In [57]:
titanic[titanic['Age'].notna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton
...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,Queenstown
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,Southampton
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,Southampton
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,Cherbourg
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,Queenstown

### (5) [air quality] 오존 농도 10~20 사이의 데이터를 조회하시오.

In [31]:
air[air['Ozone'].between(10, 20)]

     Ozone  Solar.R  Wind  Temp        Date
2       12    149.0  12.6    74  1973-05-03
3       18    313.0  11.5    62  1973-05-04
4       19      NaN  14.3    56  1973-05-05
7       19     99.0  13.8    59  1973-05-08
9       20    194.0   8.6    69  1973-05-10
11      16    256.0   9.7    69  1973-05-12
12      11    290.0   9.2    66  1973-05-13
13      14    274.0  10.9    68  1973-05-14
14      18     65.0  13.2    58  1973-05-15
15      14    334.0  11.5    64  1973-05-16
19      11     44.0   9.7    62  1973-05-20
21      11    320.0  16.6    73  1973-05-22
24      17     66.0  16.6    57  1973-05-25
25      18    266.0  14.9    58  1973-05-26
26      15      NaN   8.0    57  1973-05-27
33      18    242.0  16.1    67  1973-06-03
48      20     37.0   9.2    65  1973-06-18
49      12    120.0  11.5    73  1973-06-19
50      13    137.0  10.3    76  1973-06-20
72      10    264.0  14.3    73  1973-07-12
81      16      7.0   6.9    74  1973-07-21
86      20     81.0   8.6    82  1973-07-26
94      16     77.0   7.4    82  1973-08-03
129     20    252.0  10.9    80  1973-09-07
137     13    112.0  11.5    71  1973-09-15
139     18    224.0  13.8    67  1973-09-17
140     13     27.0  10.3    76  1973-09-18
142     16    201.0   8.0    82  1973-09-20
143     13    238.0  12.6    64  1973-09-21
147     14     20.0  16.6    63  1973-09-25
150     14    191.0  14.3    75  1973-09-28
151     18    131.0   8.0    76  1973-09-29
152     20    223.0  11.5    68  1973-09-30

### (6) [air quality] 날짜(Date) 1973-05-01, 1973-06-01, 1973-07-01 , 1973-08-01 을 조회하시오.

In [32]:
air[air['Date'].isin(['1973-05-01', '1973-06-01', '1973-07-01' , '1973-08-01'])]

    Ozone  Solar.R  Wind  Temp        Date
0      41    190.0   7.4    67  1973-05-01
31     34    286.0   8.6    78  1973-06-01
61    135    269.0   4.1    84  1973-07-01
92     39     83.0   6.9    81  1973-08-01

# 4.데이터프레임 값 변경

### (1) [titanic] 승선지역(Embarked)을 변경하시오.(.map)
* Southamton --> S
* Cherbourg --> C
* Queenstown --> Q

In [36]:
titanic['Embarked'] = titanic['Embarked'].map({'Southampton':'S', 'Cherbourg':'C', 'Queenstown':'Q'})
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,S

### (2) [titanic] 운임(Fare)을 다음과 같이 변경하시오.(pd.cut)
*  <= 30 ==> 'L'
*  <= 100 ==> 'M'
* 100 <   ==> 'H'

In [37]:
bin = [-np.inf, 30, 100, np.inf]
titanic['Fare'] = pd.cut(titanic['Fare'], bins=bin, labels=['L','M','H'])

titanic['Fare'].value_counts()

L    657
M    181
H     53
Name: Fare, dtype: int64

### (3) [titanic] 성별(Sex)을 다음과 같이 변경하시오.(np.where)
* female ==> 0
* male ==> 1

In [38]:
titanic['Sex'] = np.where(titanic['Sex'] == 'female', 0, 1)
titanic['Sex'].value_counts()

1    577
0    314
Name: Sex, dtype: int64